app/views/grades/_form.html.erb

    <%= f.label :management_id, "Gestion a la cual Corresponde el Curso" %>
    <%= f.collection_select(:management_id, Management.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>
---
SELECT "managements".* FROM "managements"