app/views/grades/show.html.erb

                          <td><%= parallel.name %></td>
                          <td><%= link_to 'Planificacion', (Schedule.find_by(parallel_id: parallel.id))%></td>
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."parallel_id" = $1 LIMIT $2  [["parallel_id", 1], ["LIMIT", 1]]