app/controllers/admin/users_controller.rb

    def create
      @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "last_name", "phone", "ci", "role") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"