app/views/list_of_children/_form.html.erb

SELECT "students".* FROM "students"
---
  <%= f.label :student_id, "Estudiante" %>
  <%= f.collection_select(:student_id, Student.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>

SELECT "users".* FROM "users"
---
  <%= f.label :user_id, "Padre" %>
  <%= f.collection_select(:user_id, User.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>