app/views/planners/_form.html.erb

SELECT "students".* FROM "students"
---
  <%= f.label :student_id %>
  <%= f.collection_select(:student_id, Student.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>