app/views/schedules/_form.html.erb

SELECT "parallels".* FROM "parallels"
---
  <%= f.label :parallel_id %>
  <%= f.collection_select(:parallel_id, Parallel.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>