app/views/parallels/_form.html.erb

    <%= f.label :grade_id, "Curso al que corresponde" %>
    <%= f.collection_select(:grade_id, Grade.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>
---
SELECT "grades".* FROM "grades"

    <%= f.label :user_id, "Profesor del Curso" %>
    <%= f.collection_select(:user_id, User.where(role: 'teacher'), :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "teacher"]]