app/views/parallels/show.html.erb

                        <tr>
                          <td><%= Student.find_by(id: student.student_id).rude %></td>
---
SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

                          <td><%= Student.find_by(id: student.student_id).last_name %></td>
                          <td> <%= link_to 'Agenda' ,Planner.find_by(student_id: Student.find_by(id: student.student_id).id) %> </td>
                          <td> <%= link_to 'Licencias' ,BookOfPermission.find_by(student_id: Student.find_by(id: student.student_id).id) %> </td>
---
SELECT  "planners".* FROM "planners" WHERE "planners"."student_id" = $1 LIMIT $2  [["student_id", 1], ["LIMIT", 1]]
SELECT  "book_of_permissions".* FROM "book_of_permissions" WHERE "book_of_permissions"."student_id" = $1 LIMIT $2  [["student_id", 1], ["LIMIT", 1]]