app/views/calendars/_form.html.erb

SELECT "managements".* FROM "managements"
---
  <%= f.label :management_id %>
  <%= f.collection_select(:management_id, Management.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>