app/views/calendars/show.html.erb

SELECT  "managements".* FROM "managements" WHERE "managements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
            <strong>Gestion:</strong>
            <%= Management.find(@calendar.management.id).name %>

SELECT  "calendar_tags".* FROM "calendar_tags" WHERE "calendar_tags"."calendar_tag_id" = 1 LIMIT $1  [["LIMIT", 1]]
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                        <td><%= calendar_detail.description %></td>
                        <td><%= CalendarTag.find_by(id: calendar_detail.calendar_tag.id).name %></td>