app/views/inscriptions/_form.html.erb

    <%= f.label :student_id, "Estudiante" %>
    <%= f.collection_select(:student_id, Student.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>
---
SELECT "students".* FROM "students"

    <%= f.label :parallel_id, "Gestion a la cual Corresponde el Curso" %>
    <%= f.collection_select(:parallel_id, Parallel.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>
---
SELECT "parallels".* FROM "parallels"