app/views/calendar_details/_form.html.erb

SELECT "calendars".* FROM "calendars"
---
    <%= f.label :calendar_id, "Calendario" %>
    <%= f.collection_select(:calendar_id, Calendar.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>

SELECT "calendar_tags".* FROM "calendar_tags"
---
    <%= f.label :calendar_tag_id, "Tipo de Actividad" %>
    <%= f.collection_select(:calendar_tag_id, CalendarTag.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>