app/controllers/calendar_details_controller.rb

  def index
    @calendar_details = CalendarDetail.all
---
SELECT "calendar_details".* FROM "calendar_details"

  def create
    @calendar_detail = CalendarDetail.new(calendar_detail_params)

    respond_to do |format|
      if @calendar_detail.save
---
INSERT INTO "calendar_details" ("name", "init_date", "description", "calendar_id", "calendar_tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_calendar_detail
      @calendar_detail = CalendarDetail.find(params[:id])
---
SELECT  "calendar_details".* FROM "calendar_details" WHERE "calendar_details"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]