app/controllers/calendars_controller.rb

  def index
    @calendars = Calendar.all
---
SELECT "calendars".* FROM "calendars"

  def show
    @calendar_details = CalendarDetail.where(calendar_id: params[:id])
    @calendar_tags = CalendarTag.all
---
SELECT "calendar_details".* FROM "calendar_details" WHERE "calendar_details"."calendar_id" = $1  [["calendar_id", 1]]
SELECT  "calendar_tags".* FROM "calendar_tags" WHERE "calendar_tags"."calendar_tag_id" = 1 LIMIT $1  [["LIMIT", 1]]

  def create
    @calendar = Calendar.new(calendar_params)

    respond_to do |format|
      if @calendar.save
---
INSERT INTO "calendars" ("name", "management_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Calendario Escolar"], ["management_id", 1], ["created_at", 2018-05-01 14:02:18 UTC], ["updated_at", 2018-05-01 14:02:18 UTC]]

  def update
    respond_to do |format|
      if @calendar.update(calendar_params)
---
UPDATE "calendars" SET "name" = $1, "updated_at" = $2 WHERE "calendars"."id" = $3  [["name", "Calendario Escolar1"], ["updated_at", 2018-05-01 22:41:28 UTC], ["id", 1]]

    def set_calendar
      @calendar = Calendar.find(params[:id])
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]