app/controllers/calendar_tags_controller.rb

  def index
    @calendar_tags = CalendarTag.all
---
SELECT "calendar_tags".* FROM "calendar_tags"

  def create
    @calendar_tag = CalendarTag.new(calendar_tag_params)

    respond_to do |format|
      if @calendar_tag.save
---
INSERT INTO "calendar_tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asdfasdf"], ["created_at", 2018-05-01 21:00:31 UTC], ["updated_at", 2018-05-01 21:00:31 UTC]]

  def update
    respond_to do |format|
      if @calendar_tag.update(calendar_tag_params)
---
UPDATE "calendar_tags" SET "name" = $1, "updated_at" = $2 WHERE "calendar_tags"."id" = $3  [["name", "asdfasdfssss"], ["updated_at", 2018-05-01 22:43:32 UTC], ["id", 1]]

    def set_calendar_tag
      @calendar_tag = CalendarTag.find(params[:id])
---
SELECT  "calendar_tags".* FROM "calendar_tags" WHERE "calendar_tags"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]