app/controllers/grades_controller.rb

  def index
    @grades = Grade.all
---
SELECT "grades".* FROM "grades"

  def show
    @parallels = Parallel.where(grade_id: params[:id])
---
SELECT "parallels".* FROM "parallels" WHERE "parallels"."grade_id" = $1  [["grade_id", 1]]

  def create
    @grade = Grade.new(grade_params)

    respond_to do |format|
      if @grade.save
---
INSERT INTO "grades" ("name", "management_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1º de Primaria"], ["management_id", 1], ["created_at", 2018-05-01 22:59:06 UTC], ["updated_at", 2018-05-01 22:59:06 UTC]]

    def set_grade
      @grade = Grade.find(params[:id])
---
SELECT  "grades".* FROM "grades" WHERE "grades"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]