app/controllers/inscriptions_controller.rb

SELECT "inscriptions".* FROM "inscriptions"
---
  def index
    @inscriptions = Inscription.all

INSERT INTO "inscriptions" ("student_id", "parallel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["student_id", 1], ["parallel_id", 1], ["created_at", 2018-05-02 12:27:50 UTC], ["updated_at", 2018-05-02 12:27:50 UTC]]
---
  def create
    @inscription = Inscription.new(inscription_params)

    respond_to do |format|
      if @inscription.save

SELECT  "inscriptions".* FROM "inscriptions" WHERE "inscriptions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_inscription
      @inscription = Inscription.find(params[:id])