app/controllers/managements_controller.rb

  def index
    @managements = Management.all
---
SELECT "managements".* FROM "managements"

  def show
    @grades = Grade.where(management_id: params[:id])
---
SELECT "grades".* FROM "grades" WHERE "grades"."management_id" = $1  [["management_id", 1]]

  def create
    @management = Management.new(management_params)

    respond_to do |format|
      if @management.save
---
INSERT INTO "managements" ("name", "init_date", "finish_date", "turn_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Gestion 2018"], ["init_date", Tue, 01 May 2018], ["finish_date", Sat, 01 Dec 2018], ["turn_id", 1], ["created_at", 2018-05-01 05:48:16 UTC], ["updated_at", 2018-05-01 05:48:16 UTC]]

    def set_management
      @management = Management.find(params[:id])
---
SELECT  "managements".* FROM "managements" WHERE "managements"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]