app/controllers/parallels_controller.rb

SELECT "parallels".* FROM "parallels"
---
  def index
    @parallels = Parallel.all

SELECT "inscriptions".* FROM "inscriptions" INNER JOIN "students" ON "students"."id" = "inscriptions"."student_id" WHERE "inscriptions"."parallel_id" = $1  [["parallel_id", 1]]
---
  def show
    @students = Inscription.joins(:student).where(parallel_id: params[:id])

INSERT INTO "parallels" ("name", "grade_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "A"], ["grade_id", 1], ["teacher_id", 3], ["created_at", 2018-05-01 23:59:05 UTC], ["updated_at", 2018-05-01 23:59:05 UTC]]
---
  def create
    @parallel = Parallel.new(parallel_params)

    respond_to do |format|
      if @parallel.save

UPDATE "parallels" SET "user_id" = $1, "updated_at" = $2 WHERE "parallels"."id" = $3  [["user_id", 2], ["updated_at", 2018-05-02 00:07:16 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @parallel.update(parallel_params)

SELECT  "parallels".* FROM "parallels" WHERE "parallels"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_parallel
      @parallel = Parallel.find(params[:id])