app/controllers/permissions_controller.rb

SELECT "permissions".* FROM "permissions"
---
  def index
    @permissions = Permission.all