app/controllers/planners_controller.rb

SELECT "planner_details".* FROM "planner_details" WHERE "planner_details"."planner_id" = $1  [["planner_id", "1"]]
---
  def show
    @planner_details = PlannerDetail.where(planner_id: params[:id])

INSERT INTO "planners" ("name", "student_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Agenda"], ["student_id", 1], ["created_at", 2018-05-02 13:34:46 UTC], ["updated_at", 2018-05-02 13:34:46 UTC]]
---
  def create
    @planner = Planner.new(planner_params)

    respond_to do |format|
      if @planner.save

SELECT  "planners".* FROM "planners" WHERE "planners"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_planner
      @planner = Planner.find(params[:id])