app/controllers/schedules_controller.rb

  def show
    @schedule_details = ScheduleDetail.where(schedule_id: params[:id])
---
SELECT "schedule_details".* FROM "schedule_details" WHERE "schedule_details"."schedule_id" = $1  [["schedule_id", 1]]

  def create
    @schedule = Schedule.new(schedule_params)

    respond_to do |format|
      if @schedule.save
---
INSERT INTO "schedules" ("name", "parallel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Planificacion"], ["parallel_id", 1], ["created_at", 2018-05-02 13:20:07 UTC], ["updated_at", 2018-05-02 13:20:07 UTC]]