app/controllers/students_controller.rb

INSERT INTO "students" ("rude", "name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rude", 123456], ["name", "Pepe"], ["last_name", "pepe"], ["created_at", 2018-05-02 12:27:37 UTC], ["updated_at", 2018-05-02 12:27:37 UTC]]
---
  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save