app/controllers/turns_controller.rb

  def index
    @turns = Turn.all
---
SELECT "turns".* FROM "turns"

  def show
    @managements = Management.where(turn_id: params[:id])
---
SELECT "managements".* FROM "managements" WHERE "managements"."turn_id" = $1  [["turn_id", 1]]

  def create
    @turn = Turn.new(turn_params)

    respond_to do |format|
      if @turn.save
---
INSERT INTO "turns" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Manana"], ["created_at", 2018-05-01 05:47:52 UTC], ["updated_at", 2018-05-01 05:47:52 UTC]]

  def update
    respond_to do |format|
      if @turn.update(turn_params)
---
UPDATE "turns" SET "name" = $1, "updated_at" = $2 WHERE "turns"."id" = $3  [["name", "Mananan"], ["updated_at", 2018-05-01 22:38:03 UTC], ["id", 2]]

    def set_turn
      @turn = Turn.find(params[:id])
---
SELECT  "turns".* FROM "turns" WHERE "turns"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]