app/views/managements/_form.html.erb

SELECT "turns".* FROM "turns"
---
    <%= f.label :turn_id %>
    <%= f.collection_select(:turn_id, Turn.all, :id, :name, {hide_label: true}, class: "form-control m-input m-input--air") %>