app/views/managements/index.html.erb

                        <td> <%= m.finish_date %> </td>
                        <td> <%= link_to 'Calendario' ,Calendar.find_by(management_id: m.id) %> </td>
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."management_id" = $1 LIMIT $2  [["management_id", 1], ["LIMIT", 1]]